Revit 2024 API
FabricationConfiguration.GetInsulationSpecificationName Method
 Gets the insulation specification name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string GetInsulationSpecificationName(
	int specId
)
Visual Basic
Public Function GetInsulationSpecificationName ( _
	specId As Integer _
) As String
Visual C++
public:
String^ GetInsulationSpecificationName(
	int specId
)
Parameters
specId
Type: System.Int32
 The insulation specification identifier.
Return Value
 The insulation specification name.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace